## 1. Global Data - Trading Calendar

In [1]:
import dai
import pandas as pd
pd.set_option('display.max_row', 6)
pd.set_option('display.max_column', None)

## 1. Trading Days

In [2]:
# Officially Updated
dai.query("""
SELECT *
FROM all_trading_days
""").df()

            date market_code
0     1990-01-02          US
1     1990-01-02          HK
2     1990-01-03          US
...          ...         ...
26267 2026-12-29          CN
26268 2026-12-30          CN
26269 2026-12-31          CN

[26270 rows x 2 columns]

In [3]:
# Till Today
dai.query("""
SELECT *
FROM trading_days
""").df()

            date market_code
0     1959-10-01          DE
1     1959-10-02          DE
2     1959-10-05          DE
...          ...         ...
66679 2026-02-20          HK
66680 2026-02-20          US
66681 2026-02-20          SG

[66682 rows x 2 columns]

## 2. Holidays

In [4]:
dai.query("""
SELECT *
FROM holidays
""").df()

          date market_code
0   2005-01-03          CN
1   2005-02-07          CN
2   2005-02-08          CN
..         ...         ...
393 2026-10-05          CN
394 2026-10-06          CN
395 2026-10-07          CN

[396 rows x 2 columns]